app/controllers/activities_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `activities` ORDER BY created_at DESC LIMIT 0, 15
SELECT count(*) AS count_all FROM `activities`
---
  def index
    if params[:user_id]
      # show activities for the specified user
      @user = User.find(params[:user_id])
      @activities = @user.activities.paginate(:all, :page => params[:page], :order => 'created_at DESC')