app/controllers/admin_controller.rb

  def users
    @page = 'users'
    respond_to do |format|
      format.html {
        @users = User.find(:all)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1