app/controllers/announcements_controller.rb

  def index
    @announcements = Announcement.paginate(:all, :page => params[:page], :order => 'created_at DESC')
---
SELECT * FROM `announcements` ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `announcements`

  def edit
    @announcement = Announcement.find(params[:id])
---
SELECT * FROM `announcements` WHERE (`announcements`.`id` = 1)

  def create
    @announcement = Announcement.new(params[:announcement])
    @announcement.user = current_user
    respond_to do |format|
      if @announcement.save
---
INSERT INTO `announcements` (`created_at`, `title`, `body`, `updated_at`, `group_id`, `user_id`) VALUES('2010-02-19 00:40:08', 'Test Announcement', 'Test Announcement Body', '2010-02-19 00:40:08', NULL, 1)

  def update
    @announcement = Announcement.find(params[:id])
    respond_to do |format|
      if @announcement.update_attributes(params[:announcement])
---
SELECT * FROM `announcements` WHERE (`announcements`.`id` = 1)
UPDATE `announcements` SET `updated_at` = '2010-02-19 00:40:08', `title` = 'Test Announcement', `body` = 'Test Announcement Body' WHERE `id` = 1

  def destroy
    @announcement = Announcement.find(params[:id])
    @announcement.destroy
---
SELECT * FROM `announcements` WHERE (`announcements`.`id` = 1)
DELETE FROM `announcements` WHERE `id` = 1