app/controllers/blog_posts_controller.rb

SELECT * FROM `blog_posts` ORDER BY created_at DESC LIMIT 0, 6
SELECT count(*) AS count_all FROM `blog_posts`
---
  def index
    @section = 'BLOGS'
    if params[:user_id]
      index_blog_posts_for_user
    else
      # show paginated view of all blog posts
      @blog_posts = BlogPost.paginate(:all, :page => params[:page], :order => 'created_at DESC')

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
UPDATE `blog_posts` SET `views` = 1, `updated_at` = '2010-02-19 00:40:08' WHERE `id` = 1
---
  def show
    @blog_post = BlogPost.find(params[:id])
    @blog_post.update_attributes(:views=>@blog_post.views+1)

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
---
  def edit
    @blog_post = BlogPost.find(params[:id])

INSERT INTO `blog_posts` (`created_at`, `title`, `body`, `guid`, `published`, `featured`, `updated_at`, `url`, `views`, `user_id`, `parent_id`, `summary`, `published_at`) VALUES('2010-02-19 00:40:08', 'Test Post', 'my test post', NULL, 1, 0, '2010-02-19 00:40:08', NULL, 0, 1, NULL, NULL, NULL)
---
  def create
    @blog_post = BlogPost.new(params[:blog_post])
    @blog_post.user = current_user;
    respond_to do |format|
      if @blog_post.save

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
UPDATE `blog_posts` SET `updated_at` = '2010-02-24 00:32:02', `guid` = '22222', `title` = 'API Test Post', `url` = 'http://www.apiblogpost.com', `body` = 'API Test Body' WHERE `id` = 1
---
  def update
    @blog_post = BlogPost.find(params[:id])
    respond_to do |format|
      if @blog_post.update_attributes(params[:blog_post])

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
DELETE FROM `blog_posts` WHERE `id` = 1
---
  def destroy
    @blog_post = BlogPost.find(params[:id])
    @blog_post.destroy