app/controllers/book_reviews_controller.rb

  def show
    @book_review = BookReview.find(params[:id])
---
SELECT * FROM `book_reviews` WHERE (`book_reviews`.`id` = 1)

  def edit
    @book_review = BookReview.find(params[:id])
---
SELECT * FROM `book_reviews` WHERE (`book_reviews`.`id` = 1)

  def create
    @book_review = BookReview.new(params[:book_review])
    respond_to do |format|
      if @book_review.save
---
INSERT INTO `book_reviews` (`name`, `buy_link`, `created_at`, `image_url`, `featured`, `updated_at`, `review`, `publisher`, `user_id`, `website`, `release_date`) VALUES('Test Review', NULL, '2010-02-19 00:40:08', NULL, 0, '2010-02-19 00:40:08', NULL, 'Marvel', 1, 'website.com', NULL)

  def update
    @book_review = BookReview.find(params[:id])
---
SELECT * FROM `book_reviews` WHERE (`book_reviews`.`id` = 1)

  def destroy
    @book_review = BookReview.find(params[:id])
    @book_review.destroy
---
SELECT * FROM `book_reviews` WHERE (`book_reviews`.`id` = 1)
DELETE FROM `book_reviews` WHERE `id` = 1