app/controllers/bug_reports_controller.rb

  def show
    @bug_report = BugReport.find(params[:id])
---
SELECT * FROM `bug_reports` WHERE (`bug_reports`.`id` = 1)

  def edit
    @bug_report = BugReport.find(params[:id])
---
SELECT * FROM `bug_reports` WHERE (`bug_reports`.`id` = 1)

  def create
    @bug_report = BugReport.new(params[:bug_report])
    if logged_in?
      @bug_report.user_id = current_user.id
    end
    respond_to do |format|
      if @bug_report.save
---
INSERT INTO `bug_reports` (`comment`, `created_at`, `title`, `module`, `resolution_date`, `updated_at`, `resolved`, `priority`, `user_id`, `browser`, `description`) VALUES('test comment', '2010-02-19 00:40:08', 'Test Bug', 'test module', NULL, '2010-02-19 00:40:08', 0, 'high', 1, 'IE', 'This is a bug')

  def update
    @bug_report = BugReport.find(params[:id])
    respond_to do |format|
      if @bug_report.update_attributes(params[:bug_report])
---
SELECT * FROM `bug_reports` WHERE (`bug_reports`.`id` = 1)
UPDATE `bug_reports` SET `updated_at` = '2010-02-19 00:40:09', `comment` = 'comment', `title` = 'Test Bug Report', `browser` = 'FIREFOX', `description` = 'I am reporting a bug' WHERE `id` = 1

  def destroy
    @bug_report = BugReport.find(params[:id])
    @bug_report.destroy
---
SELECT * FROM `bug_reports` WHERE (`bug_reports`.`id` = 1)
DELETE FROM `bug_reports` WHERE `id` = 1