app/controllers/classifieds_controller.rb

  def show
    @classified = Classified.find(params[:id])
---
SELECT * FROM `classifieds` WHERE (`classifieds`.`id` = 980190962)

  def edit
    @classified = Classified.find(params[:id])
---
SELECT * FROM `classifieds` WHERE (`classifieds`.`id` = 980190962)

  def create
    @classified = Classified.new(params[:classified])
    @classified.user = current_user;
    respond_to do |format|
      if @classified.save
---
INSERT INTO `classifieds` (`created_at`, `title`, `updated_at`, `user_id`, `classified_category_id`, `description`) VALUES('2010-02-19 00:40:09', NULL, '2010-02-19 00:40:09', NULL, NULL, NULL)

  def update
    @classified = Classified.find(params[:id])
---
SELECT * FROM `classifieds` WHERE (`classifieds`.`id` = 980190962)

  def destroy
    @classified = Classified.find(params[:id])
    @classified.destroy
---
SELECT * FROM `classifieds` WHERE (`classifieds`.`id` = 980190962)
DELETE FROM `classifieds` WHERE `id` = 980190962