app/controllers/events_controller.rb

SELECT * FROM `events` WHERE (start_time>now()) ORDER BY start_time ASC
---
  def index
    @section = 'EVENTS'
    @events = Event.find(:all, :conditions=>'start_time>now()', :order=>'start_time ASC')

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def show
    @event = Event.find(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO `events` (`name`, `city`, `end_time`, `location`, `organized_by`, `created_at`, `updated_at`, `street`, `user_id`, `website`, `phone`, `photo_id`, `description`, `event_type`, `start_time`) VALUES('Test Event', 'Detroit', '2010-02-19 00:40:09', 'Compuware HQ', 'test dude', '2010-02-19 00:40:13', '2010-02-19 00:40:13', 'Fort', 1, 'website.com', '555-1212', NULL, 'Event Desc', 'party', '2010-02-19 00:40:09')
---
  def create
    sleep 4  # required for photo upload
    @event = Event.new(params[:event])
    @event.user = current_user
    respond_to do |format|
      if @event.save

SELECT * FROM `events` WHERE (`events`.`id` = 1)
UPDATE `events` SET `phone` = '555-1212', `updated_at` = '2010-02-19 00:40:13', `name` = 'Test Event', `start_time` = '2010-02-19 00:40:13', `organized_by` = 'test dude', `location` = 'Compuware HQ', `event_type` = 'party', `city` = 'Detroit', `street` = 'Fort', `description` = 'Event Desc', `user_id` = 1, `end_time` = '2010-02-19 00:40:13', `website` = 'website.com' WHERE `id` = 1
---
  def update
    @event = Event.find(params[:id])
    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT * FROM `events` WHERE (`events`.`id` = 1)
DELETE FROM `events` WHERE `id` = 1
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy