app/controllers/facebook_posts_controller.rb

SELECT * FROM `facebook_posts` WHERE (`facebook_posts`.`id` = 1)
---
  def show
    @facebook_post = FacebookPost.find(params[:id])

SELECT * FROM `facebook_posts` WHERE (`facebook_posts`.`id` = 1)
---
  def edit
    @facebook_post = FacebookPost.find(params[:id])

INSERT INTO `facebook_posts` (`created_at`, `updated_at`) VALUES('2010-02-19 00:40:13', '2010-02-19 00:40:13')
---
  def create
    @facebook_post = FacebookPost.new(params[:facebook_post])

    respond_to do |format|
      if @facebook_post.save

SELECT * FROM `facebook_posts` WHERE (`facebook_posts`.`id` = 1)
---
  def update
    @facebook_post = FacebookPost.find(params[:id])

SELECT * FROM `facebook_posts` WHERE (`facebook_posts`.`id` = 1)
DELETE FROM `facebook_posts` WHERE `id` = 1
---
  def destroy
    @facebook_post = FacebookPost.find(params[:id])
    @facebook_post.destroy