app/controllers/feeds_controller.rb

  def edit
    @feed = Feed.find(params[:id])
---
SELECT * FROM `feeds` WHERE (`feeds`.`id` = 1)

  def create
    @feed = Feed.new(params[:feed])
    respond_to do |format|
      if @feed.save
---
INSERT INTO `feeds` (`created_at`, `updated_at`) VALUES('2010-02-19 00:40:13', '2010-02-19 00:40:13')

  def update
    @feed = Feed.find(params[:id])
---
SELECT * FROM `feeds` WHERE (`feeds`.`id` = 1)

  def destroy
    @feed = Feed.find(params[:id])
    @feed.destroy
---
SELECT * FROM `feeds` WHERE (`feeds`.`id` = 1)
DELETE FROM `feeds` WHERE `id` = 1