app/controllers/forum_posts_controller.rb

  def show
    @forum_post = ForumPost.find(params[:id])
    if @forum_post.parent_id != nil
      @forum_post = ForumPost.find(@forum_post.parent_id)
    end
    @forum_post.update_attributes(:views=>@forum_post.views+1)
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.parent_id = 1)
UPDATE `forum_posts` SET `views` = 1, `updated_at` = '2010-02-19 00:40:13' WHERE `id` = 1

  def edit
    @forum_post = ForumPost.find(params[:id])
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.`id` = 1)

  def create
    @forum_post = ForumPost.new(params[:forum_post])
    @forum_post.user = current_user;
    respond_to do |format|
      if @forum_post.save
        if params[:ajax_call]
          @forum_post = ForumPost.find(@forum_post.parent_id)
---
INSERT INTO `forum_posts` (`forum_topic_id`, `created_at`, `title`, `body`, `featured`, `updated_at`, `views`, `user_id`, `parent_id`) VALUES(NULL, '2010-02-19 00:40:13', NULL, NULL, NULL, '2010-02-19 00:40:13', 0, 1, NULL)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update
    @forum_post = ForumPost.find(params[:id])
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.`id` = 1)

  def destroy
    @forum_post = ForumPost.find(params[:id])
    @forum_post.destroy
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.`id` = 1)
DELETE FROM `forum_posts` WHERE `id` = 1