app/controllers/forum_topics_controller.rb

  def show
    @forum_topic = ForumTopic.find(params[:id])
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 1)

  def create
    @forum_topic = ForumTopic.new(params[:forum_topic])
    respond_to do |format|
      if @forum_topic.save
---
INSERT INTO `forum_topics` (`created_at`, `title`, `updated_at`, `user_id`, `description`) VALUES('2010-02-19 00:40:13', NULL, '2010-02-19 00:40:13', NULL, NULL)

  def update
    @forum_topic = ForumTopic.find(params[:id])
    respond_to do |format|
      if @forum_topic.update_attributes(params[:forum_topic])
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 1)
UPDATE `forum_topics` SET `updated_at` = '2010-02-26 05:04:19', `title` = 'Updated API Test Topic', `description` = 'Updated Test topic desc' WHERE `id` = 1

  def destroy
    @forum_topic = ForumTopic.find(params[:id])
    @forum_topic.destroy
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 1)
DELETE FROM `forum_topics` WHERE `id` = 1