app/controllers/friends_controller.rb

  def index
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    @user = User.find(current_user)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def update
    @user = User.find(current_user)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1