app/controllers/groups_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `groups`
---
  def index
    @section = 'GROUPS'
    if params[:user_id]
      @user = User.find(params[:user_id])
      @groups = @user.groups

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def show
    @group = Group.find(params[:id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def edit
    @group = Group.find(params[:id])

INSERT INTO `groups` (`name`, `created_at`, `featured`, `announcements`, `private`, `updated_at`, `creator_id`, `description`, `photo_id`) VALUES('unit test group', '2010-02-19 00:38:46', 0, NULL, 0, '2010-02-19 00:38:46', 1, 'my desc', NULL)
---
  def create
    sleep 4  # required for photo upload
    @group = Group.new(params[:group])
    @group.creator = current_user;
    respond_to do |format|
      if @group.save

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
UPDATE `groups` SET `updated_at` = '2010-02-19 00:40:22', `name` = 'New Name', `description` = 'New Desc.' WHERE `id` = 1
---
  def update
    sleep 4  # required for photo upload
    @group = Group.find(params[:id])
    respond_to do |format|
      if @group.update_attributes(params[:group])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
DELETE FROM `groups` WHERE `id` = 1
---
  def destroy
    @group = Group.find(params[:id])
    @group.destroy