app/controllers/html_contents_controller.rb

SELECT * FROM `html_contents` WHERE (`html_contents`.`id` = 1)
---
  def edit
    @html_content = HtmlContent.find(params[:id])

INSERT INTO `html_contents` (`created_at`, `title`, `body`, `widget_id`, `updated_at`, `content_id`) VALUES('2010-02-19 00:40:22', NULL, NULL, NULL, '2010-02-19 00:40:22', NULL)
---
  def create
    @html_content = HtmlContent.new(params[:html_content])
    respond_to do |format|
      if @html_content.save

SELECT * FROM `html_contents` WHERE (`html_contents`.`id` = 1)
---
  def update
    @html_content = HtmlContent.find(params[:id])

SELECT * FROM `html_contents` WHERE (`html_contents`.`id` = 1)
DELETE FROM `html_contents` WHERE `id` = 1
---
  def destroy
    @html_content = HtmlContent.find(params[:id])
    @html_content.destroy