app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])
---
SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)

  def edit
    @idea = Idea.find(params[:id])
---
SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)

  def create
    @idea = Idea.new(params[:idea])
    @idea.user = current_user
    if params[:group_id]
      @idea.group_id = params[:group_id]
    end
    respond_to do |format|
      if @idea.save
---
INSERT INTO `ideas` (`created_at`, `title`, `updated_at`, `user_id`, `description`) VALUES('2010-02-19 00:40:22', 'Idea 1', '2010-02-19 00:40:22', NULL, 'Idea 1 Desc')

  def update
    @idea = Idea.find(params[:id])
    respond_to do |format|
      if @idea.update_attributes(params[:idea])
---
SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
UPDATE `ideas` SET `updated_at` = '2010-02-19 00:40:22', `title` = 'Idea 1', `description` = 'Idea 1 Desc' WHERE `id` = 1

  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
DELETE FROM `ideas` WHERE `id` = 1