app/controllers/invites_controller.rb

  def show
    @invite = Invite.find(params[:id])
---
SELECT * FROM `invites` WHERE (`invites`.`id` = 980190962)

  def edit
    @invite = Invite.find(params[:id])
---
SELECT * FROM `invites` WHERE (`invites`.`id` = 980190962)

  def create
    @invite = Invite.new(params[:invite])
    if Invite.find_by_email(@invite.email)
      # recipient has already been invited by this user
      respond_to do |format|
        flash[:notice] = 'You have already invited this user.'
        format.html { render :action => "new" }
        format.xml  { render :status => :unprocessable_entity }
        format.json  { render :status => :unprocessable_entity }
      end
    else
      @invite.user = current_user
      @invite.accepted = false
      @invite.invite_code = Invite.generate_invite_code
      respond_to do |format|
        if @invite.save
---
SELECT * FROM `invites` WHERE (`invites`.`email` = 'user@test.com') LIMIT 1
INSERT INTO `invites` (`created_at`, `updated_at`, `invite_code`, `user_id`, `message`, `accepted`, `email`) VALUES('2010-02-19 00:40:22', '2010-02-19 00:40:22', 'qymCfMVGx6vJ3VUs', 1, 'Invite Message', 0, 'test@email.com')

  def update
    @invite = Invite.find(params[:id])
    respond_to do |format|
      if @invite.update_attributes(params[:invite])
---
SELECT * FROM `invites` WHERE (`invites`.`id` = 980190962)
UPDATE `invites` SET `updated_at` = '2010-02-24 00:42:33', `message` = 'Invite Message', `email` = 'test@email.com', `invite_code` = '12345' WHERE `id` = 1

  def destroy
    @invite = Invite.find(params[:id])
    @invite.destroy
---
SELECT * FROM `invites` WHERE (`invites`.`id` = 980190962)
DELETE FROM `invites` WHERE `id` = 980190962