app/controllers/job_posts_controller.rb

SELECT * FROM `job_posts` WHERE (`job_posts`.`id` = 1)
---
  def edit
    @job_post = JobPost.find(params[:id])

INSERT INTO `job_posts` (`company`, `contact_name`, `created_at`, `job_title`, `featured`, `updated_at`, `website`, `description`, `job_id`, `end_date`, `email`) VALUES('Goodco', 'contactman', '2010-02-19 00:40:22', 'super job', 0, '2010-02-19 00:40:22', 'website.com', 'an ok job', 1, '2010-02-18 19:40:22', 'mail@mail.com')
---
  def create
    @job_post = JobPost.new(params[:job_post])
    respond_to do |format|
      if @job_post.save

SELECT * FROM `job_posts` WHERE (`job_posts`.`id` = 1)
---
  def update
    @job_post = JobPost.find(params[:id])

SELECT * FROM `job_posts` WHERE (`job_posts`.`id` = 1)
DELETE FROM `job_posts` WHERE `id` = 1
---
  def destroy
    @job_post = JobPost.find(params[:id])
    @job_post.destroy