app/controllers/links_controller.rb

  def index
    @section = 'LINKS'
    if params[:user_id]
      @user = User.find(params[:user_id])
      @links = @user.links.paginate(:all, :page => params[:page], :order => 'created_at DESC')
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `links` ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `links`

  def show
    @link = Link.find(params[:id])
---
SELECT * FROM `links` WHERE (`links`.`id` = 1)

  def edit
    @link = Link.find(params[:id])
---
SELECT * FROM `links` WHERE (`links`.`id` = 980190962)

  def create
    @link = Link.new(params[:link])
    @link.user_id = current_user.id
    respond_to do |format|
      if @link.save
---
INSERT INTO `links` (`created_at`, `title`, `updated_at`, `url`, `user_id`) VALUES('2010-02-19 00:40:23', 'My Link', '2010-02-19 00:40:23', 'http://www.link.com', 1)

  def update
    @link = Link.find(params[:id])
    respond_to do |format|
      if @link.update_attributes(params[:link])
---
SELECT * FROM `links` WHERE (`links`.`id` = 980190962)
UPDATE `links` SET `updated_at` = '2010-02-19 00:40:23', `title` = 'My Link', `url` = 'http://www.link.com' WHERE `id` = 980190962

  def destroy
    @link = Link.find(params[:id])
    @link.destroy
---
SELECT * FROM `links` WHERE (`links`.`id` = 980190962)
DELETE FROM `links` WHERE `id` = 980190962