app/controllers/messages_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    user = User.find(params[:user_id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 980190962)
---
  def show
    @message = Message.find(params[:id])

SELECT * FROM `users` WHERE (activated_at is not null)
---
  def new
    @message = Message.new
    @recipient_id = params[:recipient_id]
    @subject = params[:subject]
    if @recipient_id == nil
      @users = User.find(:all, :conditions => "activated_at is not null")

INSERT INTO `messages` (`created_at`, `body`, `updated_at`, `read`, `subject`, `recipient_id`, `sender_id`) VALUES('2010-02-19 00:40:23', 'message body', '2010-02-19 00:40:23', 0, 'a message', 2, 1)
---
  def create
    @message = Message.new(params[:message])
    @message.sender_id = current_user.id
    respond_to do |format|
      if @message.save

SELECT * FROM `messages` WHERE (`messages`.`id` = 980190962)
---
  def update
    @message = Message.find(params[:id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 980190962)
DELETE FROM `messages` WHERE `id` = 980190962
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy