app/controllers/networks_controller.rb

  def edit
    @network = Network.find(params[:id])
---
SELECT * FROM `networks` WHERE (`networks`.`id` = 1)