app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def create
    @page = Page.new(params[:page])
    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`permalink`, `created_at`, `title`, `body`, `updated_at`) VALUES('page_title', '2010-02-19 00:40:23', 'page title', 'page body', '2010-02-19 00:40:23')

  def update
    @page = Page.find(params[:id])
    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `updated_at` = '2010-02-19 00:40:23', `title` = 'page title 2', `permalink` = 'link', `body` = 'page body 2' WHERE `id` = 1

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
DELETE FROM `pages` WHERE `id` = 1