app/controllers/photo_albums_controller.rb

  def edit
    @photo_album = PhotoAlbum.find(params[:id])
---
SELECT * FROM `photo_albums` WHERE (`photo_albums`.`id` = 1)

  def create
    @photo_album = PhotoAlbum.new(params[:photo_album])
    @photo_album.user_id = current_user.id
    respond_to do |format|
      if @photo_album.save
---
INSERT INTO `photo_albums` (`created_at`, `title`, `updated_at`, `user_id`, `description`, `view_count`) VALUES('2010-02-19 00:40:23', 'test album', '2010-02-19 00:40:23', 1, 'test album desc', NULL)

  def update
    @photo_album = PhotoAlbum.find(params[:id])
    respond_to do |format|
      if @photo_album.update_attributes(params[:photo_album])
---
SELECT * FROM `photo_albums` WHERE (`photo_albums`.`id` = 1)
UPDATE `photo_albums` SET `updated_at` = '2010-02-19 00:40:23', `title` = 'test album', `description` = 'test album desc' WHERE `id` = 1

  def destroy
    @photo_album = PhotoAlbum.find(params[:id])
    @photo_album.destroy
---
SELECT * FROM `photo_albums` WHERE (`photo_albums`.`id` = 1)
DELETE FROM `photo_albums` WHERE `id` = 1