app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.user_id = 1 AND (is_profile = 1)) LIMIT 1

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.user_id = 1 AND (is_profile = 1)) LIMIT 1

  def create
    sleep 5
    @photo = Photo.new(params[:photo])
    @photo.user = current_user;
    if @photo.save
---
INSERT INTO `photos` (`location`, `size`, `created_at`, `event_id`, `title`, `content_type`, `is_profile`, `thumbnail`, `updated_at`, `photo_album_id`, `group_id`, `views`, `user_id`, `parent_id`, `filename`, `height`, `description`, `width`, `view_count`) VALUES(NULL, 13695, '2010-02-19 00:40:28', NULL, 'some title', 'image/png', 1, 'thumbnail', '2010-02-19 00:40:28', NULL, NULL, 0, 1, NULL, 'filename', 64, 'some desc', 50, NULL)

  def update
    @photo = Photo.find(params[:id])
    respond_to do |format|
      if @photo.update_attributes(params[:photo])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 980190962)
UPDATE `photos` SET `updated_at` = '2010-02-24 00:17:14', `thumbnail` = 'thumbnail', `title` = 'some title', `is_profile` = 1, `content_type` = 'image/png', `height` = 96, `filename` = 'filename', `width` = 74, `description` = 'some desc', `user_id` = 1, `size` = 14152 WHERE `id` = 980190962