app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 980190962)

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 980190962)

  def create
    @project = Project.new(params[:project])
    @project.user_id = current_user.id
    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `url`, `user_id`, `description`) VALUES('My Super Project', '2010-02-19 00:40:29', '2010-02-19 00:40:29', 'http://www.myproject.org', 1, 'About my project.')

  def update
    @project = Project.find(params[:id])
    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 980190962)
UPDATE `projects` SET `updated_at` = '2010-02-19 00:40:29', `name` = 'My Super Project', `description` = 'About my project.', `url` = 'http://www.myproject.org' WHERE `id` = 980190962

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 980190962)
DELETE FROM `projects` WHERE `id` = 980190962