app/controllers/replies_controller.rb

  def edit
    @reply = Reply.find(params[:id])
---
SELECT * FROM `replies` WHERE (`replies`.`id` = 1)

  def create
    @reply = Reply.new(params[:reply])
    respond_to do |format|
      if @reply.save
---
INSERT INTO `replies` (`created_at`, `body`, `updated_at`, `user_id`, `item_id`, `item_type`) VALUES('2010-02-19 00:40:29', NULL, '2010-02-19 00:40:29', NULL, NULL, NULL)

  def update
    @reply = Reply.find(params[:id])
---
SELECT * FROM `replies` WHERE (`replies`.`id` = 1)

  def destroy
    @reply = Reply.find(params[:id])
    @reply.destroy
---
SELECT * FROM `replies` WHERE (`replies`.`id` = 1)
DELETE FROM `replies` WHERE `id` = 1