app/controllers/rss_feeds_controller.rb

  def edit
    @rss_feed = RssFeed.find(params[:id])
---
SELECT * FROM `rss_feeds` WHERE (`rss_feeds`.`id` = 1)

  def create
    @rss_feed = RssFeed.new(params[:rss_feed])
    respond_to do |format|
      if @rss_feed.save
---
INSERT INTO `rss_feeds` (`name`, `is_blog`, `created_at`, `updated_at`, `url`, `user_id`) VALUES(NULL, NULL, '2010-02-19 00:40:29', '2010-02-19 00:40:29', NULL, NULL)

  def update
    @rss_feed = RssFeed.find(params[:id])
---
SELECT * FROM `rss_feeds` WHERE (`rss_feeds`.`id` = 1)

  def destroy
    @rss_feed = RssFeed.find(params[:id])
    @rss_feed.destroy
---
SELECT * FROM `rss_feeds` WHERE (`rss_feeds`.`id` = 1)
DELETE FROM `rss_feeds` WHERE `id` = 1