app/controllers/sessions_controller.rb

SELECT * FROM `users` WHERE (login = 'quentin' and activated_at IS NOT NULL) LIMIT 1
---
  def create
    user = User.find_by_login(params[:login])

UPDATE `users` SET `updated_at` = '2010-02-19 00:40:30', `remember_token_expires_at` = '2010-03-05 00:40:30', `remember_token` = 'c0b7ea21603b7d7571e63c6b9f2b57067a891ad3' WHERE `id` = 1
---
        flush_expired_sessions
        login_count = self.current_user.login_count
        login_count = login_count + 1
        self.current_user.update_attribute('login_count', login_count)