app/controllers/status_posts_controller.rb

  def show
    @status_post = StatusPost.find(params[:id])
---
SELECT * FROM `status_posts` WHERE (`status_posts`.`id` = 1)

  def edit
    @status_post = StatusPost.find(params[:id])
---
SELECT * FROM `status_posts` WHERE (`status_posts`.`id` = 1)

  def create
    @status_post = StatusPost.new(params[:status_post])
    @status_post.user_id = current_user.id
    if @status_post.save
---
INSERT INTO `status_posts` (`created_at`, `body`, `updated_at`, `user_id`) VALUES('2010-02-19 00:40:30', NULL, '2010-02-19 00:40:30', NULL)

  def update
    @status_post = StatusPost.find(params[:id])
    respond_to do |format|
      if @status_post.update_attributes(params[:status_post])
---
SELECT * FROM `status_posts` WHERE (`status_posts`.`id` = 1)
UPDATE `status_posts` SET `updated_at` = '2010-02-24 00:17:15', `body` = 'Updated Status Post' WHERE `id` = 1

  def destroy
    @status_post = StatusPost.find(params[:id])
    @status_post.destroy
---
SELECT * FROM `status_posts` WHERE (`status_posts`.`id` = 1)
DELETE FROM `status_posts` WHERE `id` = 1