app/controllers/users_controller.rb

  def show
    if (current_user && (current_user.id.to_s == params[:id].to_s))
      @section = 'MY PAGE'
    else
      @section = 'MEMBERS'
    end
    @profile_widgets = Configuration.profile_widgets;
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 31) LIMIT 1

  def edit
    if (params[:id].to_s != current_user.id.to_s)
      # can only edit your own page
      redirect_back_or_default('/')
    end
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 31) LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.facebook_id
      # create a facebook user
      if facebook_session
        User.create_from_fb_connect(facebook_session.user, @user.email, @user.login, @user.first_name, @user.last_name)
        flash[:notice] = "Thanks for signing up!"
      end
      redirect_to '/'
    else
      # create just a local user
      sleep 4  # required for photo upload
      cookies.delete :auth_token
      @user.roles << Role.find_by_rolename('user')
      @user.save
      if @user.errors.empty?
        if @invite_code
          invite = Invite.find_by_invite_code(params[:invite_code])
          invite.update_attributes(:accepted=>true)
        end
        if params[:user_photo] && params[:user_photo].size != 0
          # remove old profile photos
          Photo.destroy_all("user_id = " + @user.id.to_s + " AND is_profile = true")
          profile_photo = ProfilePhoto.create!(:user_id=>@user.id, :is_profile=>true, :uploaded_data => params[:user_photo]) if params[:user_photo].size != 0
---
INSERT INTO `users` (`city`, `occupation`, `flickr`, `facebook_id`, `salt`, `created_at`, `zip`, `about_me`, `activated_at`, `blog`, `display_tweets`, `yahoo_messenger_name`, `skype_name`, `facebook_url`, `company_url`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `featured`, `last_seen_at`, `password_reset_code`, `country_id`, `skills`, `show_blog_posts_on_home`, `msn_name`, `activation_code`, `api_key`, `flickr_username`, `linked_in_url`, `gtalk_name`, `posts_count`, `enabled`, `email_hash`, `sex`, `phone2`, `last_name`, `phone`, `website`, `blog_feed`, `twitter_id`, `aim_name`, `resume_url`, `login_count`, `remember_token`, `is_active`, `time_zone`, `organization`, `login`, `state_id`, `youtube_username`, `identity_url`, `email`, `first_name`, `use_gravatar`, `receive_emails`) VALUES(NULL, NULL, NULL, NULL, '945f5c561aeaded4cc079d84f24021365e3e5098', '2010-02-19 00:34:19', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, 'ee436998237e6eca634c778686b118a79a5d1812', NULL, '2010-02-19 00:34:19', 0, NULL, NULL, NULL, NULL, 1, NULL, '1b4f09a1f2a8937c92f28aa9787a37cead4bd143', '', NULL, NULL, NULL, 0, 1, NULL, NULL, NULL, 'test', NULL, NULL, NULL, 'uttwit', NULL, NULL, 0, NULL, 0, 'UTC', NULL, 'ut2', NULL, NULL, NULL, 'ut2@email.com', 'unit', 0, 1)
SELECT `users`.* FROM `users` INNER JOIN `permissions` ON permissions.user_id = users.id WHERE (role_id = 2)
SELECT * FROM `roles` WHERE (`roles`.`rolename` = 'user') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-02-19 01:15:01', `activated_at` = '2010-02-19 01:15:01', `activation_code` = NULL WHERE `id` = 17
SELECT * FROM `photos` WHERE (`photos`.user_id = 4 AND (is_profile = 1)) LIMIT 1
INSERT INTO `photos` (`location`, `size`, `created_at`, `event_id`, `title`, `content_type`, `is_profile`, `thumbnail`, `updated_at`, `photo_album_id`, `group_id`, `views`, `user_id`, `parent_id`, `filename`, `height`, `description`, `width`, `view_count`) VALUES(NULL, 14344, '2010-02-19 00:34:19', NULL, NULL, 'image/png', 1, NULL, '2010-02-19 00:34:19', NULL, NULL, 0, 4, NULL, 'nophoto.png', 175, NULL, 175, NULL)

  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = '8f24789ae988411ccf33ab0c30fe9106fab32e9a') LIMIT 1