app/controllers/videos_controller.rb

  def show
    @video = Video.find(params[:id])
---
SELECT * FROM `videos` WHERE (`videos`.`id` = 1)

  def edit
    @video = Video.find(params[:id])
---
SELECT * FROM `videos` WHERE (`videos`.`id` = 1)

  def create
    @video = Video.new(params[:video])
    respond_to do |format|
      if @video.save
---
INSERT INTO `videos` (`created_at`, `updated_at`) VALUES('2010-02-19 00:40:55', '2010-02-19 00:40:55')

  def update
    @video = Video.find(params[:id])
---
SELECT * FROM `videos` WHERE (`videos`.`id` = 1)

  def destroy
    @video = Video.find(params[:id])
    @video.destroy
---
SELECT * FROM `videos` WHERE (`videos`.`id` = 1)
DELETE FROM `videos` WHERE `id` = 1