app/controllers/wall_posts_controller.rb

SELECT * FROM `wall_posts` WHERE (`wall_posts`.`id` = 1)
---
  def edit
    @wall_post = WallPost.find(params[:id])