app/controllers/wall_posts_controller.rb

SELECT * FROM `wall_posts` WHERE (`wall_posts`.user_id = 1) ORDER BY created_at DESC
INSERT INTO `wall_posts` (`created_at`, `event_id`, `updated_at`, `group_id`, `user_id`, `sender_id`, `message`) VALUES('2010-02-19 00:40:55', NULL, '2010-02-19 00:40:55', NULL, 1, 1, 'Hello World')
---
  def create
    @wall_post = WallPost.new(params[:wall_post])
    if params[:group_id]
      @wall_post.group_id = params[:group_id]
    elsif params[:event_id]
      @wall_post.event_id = params[:event_id]
    else
      @wall_post.user_id = params[:user_id]
    end
    @wall_post.sender_id = current_user.id
    respond_to do |format|
      if @wall_post.save

SELECT * FROM `wall_posts` WHERE (`wall_posts`.`id` = 1)
---
  def update
    @wall_post = WallPost.find(params[:id])

SELECT * FROM `wall_posts` WHERE (`wall_posts`.user_id = 1) ORDER BY created_at DESC
DELETE FROM `wall_posts` WHERE `id` = 1
---
  def destroy
    @wall_post = WallPost.find(params[:id])
    set_parent
    @wall_post.destroy

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def set_parent
    if @wall_post.group_id
      @parent = Group.find(@wall_post.group_id)
    elsif @wall_post.event_id
       @parent = Event.find(@wall_post.event_id)
    else
      @user = User.find(@wall_post.user_id)