app/controllers/widgets_controller.rb

SELECT * FROM `html_contents` WHERE (`html_contents`.`content_id` = '1') LIMIT 1
INSERT INTO `html_contents` (`created_at`, `title`, `body`, `widget_id`, `updated_at`, `content_id`) VALUES('2010-02-28 04:59:15', 'New Content', 'Add Some Content', NULL, '2010-02-28 04:59:15', '1')
---
  def load
    # get name of widget to load
    @widget_name = params[:name]
    content_id = params[:content_id]  # HTML widgets also pass a content_id which is used to identify content in the db
    if content_id
      @content = HtmlContent.find_by_content_id(content_id)
      if !@content
        # create content
        HtmlContent.create(:title=>'New Content', :body=>'Add Some Content', :content_id=>content_id)